#+TITLE: Meta-Cal

This repository implements our ICML2021 paper: [[https://arxiv.org/abs/2105.04290][Meta-Cal: Well-controlled
Post-hoc Calibration by Ranking]].


* installation
#+begin_src shell
git clone https://github.com/maxc01/metacal
cd metacal
poetry install
#+end_src

* usage

See the test code.
#+begin_src shell
cd metacal/tests/
python test_metacal.py
#+end_src

#+RESULTS:
: Test MisCoverage (target=0.05)
: ECE: 0.014405990597344159, empirical miscoverage: 0.013580246913580247
: Test CoverageAcc (target=0.34)
: ECE: 0.005411952048287812, empirical coverageacc: 0.3377814845704754


* note
As we've mentioned in the main paper:
#+begin_quote
To ensure the independence assumption, the training data of Meta-Cal should be
different from the data set used to train the multi-class classifier.
#+end_quote

* citation
#+begin_src bibtex
@inproceedings{Ma2021a,
  TITLE = {Meta-Cal: Well-controlled Post-hoc Calibration by Ranking},
  AUTHOR = {Ma, Xingchen and Blaschko, Matthew B.},
  BOOKTITLE = {International Conference on Machine Learning},
  YEAR = {2021},
}
#+end_src
